Antoniazdz/ot-nrf528xx/src/nrf54l15/radio_nrf54.c
static int8_t GetTransmitPowerForChannel(uint8_t aChannel)
{
    int8_t channelMaxPower = nrf5GetChannelMaxTransmitPower(aChannel);
    int8_t power           = 0; // 0 dbm as default value

    if (sDefaultTxPower != OT_RADIO_POWER_INVALID)
    {
        power = (channelMaxPower < sDefaultTxPower) ? channelMaxPower : sDefaultTxPower;
    }
    else if (channelMaxPower != OT_RADIO_POWER_INVALID)
    {
        power = channelMaxPower;
    }

    return power;
}

/* The driver timestamps the end of the last symbol; OT expects the start of the PHR. */
static uint64_t GetRxTimestamp(uint64_t aTime, uint8_t aLength)
{
    if (aTime == NRF_802154_NO_TIMESTAMP)
    {
        return nrf5AlarmGetCurrentTime();
    }

    return nrf_802154_timestamp_end_to_phr_convert(aTime, aLength);
}

static void dataInit(void)
{
    sDisabled = true;

    sDefaultTxPower      = OT_RADIO_POWER_INVALID;
    sTransmitFrame.mPsdu = sTransmitPsdu + 1;
#if OPENTHREAD_CONFIG_MAC_HEADER_IE_SUPPORT
    sTransmitFrame.mInfo.mTxInfo.mIeInfo = &sTransmitIeInfo;
#endif

    sReceiveError = OT_ERROR_NONE;

    for (uint32_t i = 0; i < NRF_802154_RX_BUFFERS; i++)
    {
        sReceivedFrames[i].mPsdu = NULL;
    }

    for (size_t i = 0; i < otARRAY_LENGTH(sMaxTxPowerTable); i++)
    {
        sMaxTxPowerTable[i] = OT_RADIO_POWER_INVALID;
    }

    memset(&sAckFrame, 0, sizeof(sAckFrame));

    sRxOnWhenIdle = true;

    SetRadioDriverState(NRF_802154_STATE_SLEEP);
}

// 802.15.4 short addresses are little-endian; native uint16_t layout matches on LE CPUs.
static inline const uint8_t *nrf54ShortAddressBytes(const uint16_t *aShortAddress)
{
    return (const uint8_t *)aShortAddress;
}

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE || OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
static inline void nrf54ExtAddressToDriverLe(uint8_t *aTo, const otExtAddress *aFrom)
{
    for (uint8_t i = 0; i < sizeof(otExtAddress); i++)
    {
        aTo[i] = aFrom->m8[sizeof(otExtAddress) - 1U - i];
    }
}

static bool nrf54AckDataSet(uint16_t            aShortAddr,
                            const otExtAddress *aExtAddr,
                            const uint8_t      *aData,
                            uint16_t            aLength)
{
    uint8_t extAddr[OT_EXT_ADDRESS_SIZE];

    nrf54ExtAddressToDriverLe(extAddr, aExtAddr);

    return nrf_802154_ack_data_set(nrf54ShortAddressBytes(&aShortAddr), false, aData, aLength,
                                   NRF_802154_ACK_DATA_IE) &&
           nrf_802154_ack_data_set(extAddr, true, aData, aLength, NRF_802154_ACK_DATA_IE);
}

static void nrf54AckDataClear(uint16_t aShortAddr, const otExtAddress *aExtAddr)
{
    uint8_t extAddr[OT_EXT_ADDRESS_SIZE];

    nrf54ExtAddressToDriverLe(extAddr, aExtAddr);

    nrf_802154_ack_data_clear(nrf54ShortAddressBytes(&aShortAddr), false, NRF_802154_ACK_DATA_IE);
    nrf_802154_ack_data_clear(extAddr, true, NRF_802154_ACK_DATA_IE);
}
#endif

static inline bool isPendingEventSet(RadioPendingEvents aEvent)
{
    return sPendingEvents & (1UL << aEvent);
}

static void setPendingEvent(RadioPendingEvents aEvent)
{
    volatile uint32_t pendingEvents;
    uint32_t          bitToSet = 1UL << aEvent;

    do
    {
        pendingEvents = __LDREXW((uint32_t *)&sPendingEvents);
        pendingEvents |= bitToSet;
    } while (__STREXW(pendingEvents, (uint32_t *)&sPendingEvents));

    otSysEventSignalPending();
}

static void resetPendingEvent(RadioPendingEvents aEvent)
{
    volatile uint32_t pendingEvents;
    uint32_t          bitsToRemain = ~(1UL << aEvent);

    do
    {
        pendingEvents = __LDREXW((uint32_t *)&sPendingEvents);
        pendingEvents &= bitsToRemain;
    } while (__STREXW(pendingEvents, (uint32_t *)&sPendingEvents));
}

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
static inline bool nrf54CslSuppressPlatformSleep(void)
{
#if NRF54_CSL_KEEP_RADIO_AWAKE
    return sCslPeriod > 0;
#else
    return false;
#endif
}

/* CSL-P0-F3b: after poll on mesh channel, leave HW RX so DRX callback is not skipped. */
static void cslScheduleSleepIfChildRxOff(void)
{
    if (nrf54CslSuppressPlatformSleep())
    {
        return;
    }

    if ((sCslPeriod > 0) && !sRxOnWhenIdle && !IsRadioDriverStateSleep())
    {
        setPendingEvent(kPendingEventSleep);
    }
}
#endif

/**
 * Enter driver sleep when the 802.15.4 driver is idle (NCS / nRF52840 contract).
 *
 * SubMac may call otPlatRadioSleep() between CSL windows; only sleep_if_idle() is used
 * so a scheduled DRX receive_at is not torn down by nrf_802154_sleep().
 *
 * @returns true if radio is in sleep (or was already idle).
 */
static bool nrf54RadioSleepIfIdle(void)
{
    if (nrf_802154_sleep_if_idle() == NRF_802154_SLEEP_ERROR_NONE)
    {
        nrf5FemDisable();
        SetRadioDriverState(NRF_802154_STATE_SLEEP);
        return true;
    }

    return false;
}

static bool nrfRadioTryEnterSleep(void)
{
    return nrf54RadioSleepIfIdle();
}

static inline void clearPendingEvents(void)
{
    // Clear pending events that could cause race in the MAC layer.
    volatile uint32_t pendingEvents;
    uint32_t          bitsToRemain = ~(0UL);

    bitsToRemain &= ~(1UL << kPendingEventSleep);

    do
    {
        pendingEvents = __LDREXW((uint32_t *)&sPendingEvents);
        pendingEvents &= bitsToRemain;
    } while (__STREXW(pendingEvents, (uint32_t *)&sPendingEvents));
}


#if !OPENTHREAD_CONFIG_ENABLE_PLATFORM_EUI64_CUSTOM_SOURCE
void otPlatRadioGetIeeeEui64(otInstance *aInstance, uint8_t *aIeeeEui64)
{
    OT_UNUSED_VARIABLE(aInstance);

    uint64_t factoryAddress;
    uint32_t index = 0;

    // Set the MAC Address Block Larger (MA-L) formerly called OUI.
    aIeeeEui64[index++] = (OPENTHREAD_CONFIG_STACK_VENDOR_OUI >> 16) & 0xff;
    aIeeeEui64[index++] = (OPENTHREAD_CONFIG_STACK_VENDOR_OUI >> 8) & 0xff;
    aIeeeEui64[index++] = OPENTHREAD_CONFIG_STACK_VENDOR_OUI & 0xff;

    // Use device identifier assigned during the production.
    factoryAddress = (uint64_t)nrf_ficr_deviceid_get(NRF_FICR, 0) << 32;
    factoryAddress |= nrf_ficr_deviceid_get(NRF_FICR, 1);
    aIeeeEui64[index++] = (uint8_t)(factoryAddress);
    aIeeeEui64[index++] = (uint8_t)(factoryAddress >> 8);
    aIeeeEui64[index++] = (uint8_t)(factoryAddress >> 16);
    aIeeeEui64[index++] = (uint8_t)(factoryAddress >> 24);
    aIeeeEui64[index++] = (uint8_t)(factoryAddress >> 32);
}
#endif // OPENTHREAD_CONFIG_ENABLE_PLATFORM_EUI64_CUSTOM_SOURCE

void otPlatRadioSetPanId(otInstance *aInstance, uint16_t aPanId)
{
    OT_UNUSED_VARIABLE(aInstance);

