Antoniazdz/ot-nrf528xx/src/nrf54l15/radio_nrf54.c
    nrf_802154_pan_id_set(nrf54ShortAddressBytes(&aPanId));
}

void otPlatRadioSetExtendedAddress(otInstance *aInstance, const otExtAddress *aExtAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    nrf_802154_extended_address_set(aExtAddress->m8);
}

void otPlatRadioSetShortAddress(otInstance *aInstance, uint16_t aShortAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    nrf_802154_short_address_set(nrf54ShortAddressBytes(&aShortAddress));
}

void nrf5RadioInit(void)
{
    dataInit();
#if OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
    otLinkMetricsInit(NRF54L15_RECEIVE_SENSITIVITY);
#endif
    nrf_802154_init();
    nrf_802154_clock_hfclk_start();
}

void nrf5RadioDeinit(void)
{
    nrf_802154_sleep();
    nrf_802154_deinit();
    sPendingEvents = 0;
    SetRadioDriverState(NRF_802154_STATE_SLEEP);
}

void nrf5RadioClearPendingEvents(void)
{
    sPendingEvents = 0;

    for (uint32_t i = 0; i < NRF_802154_RX_BUFFERS; i++)
    {
        if (sReceivedFrames[i].mPsdu != NULL)
        {
            uint8_t *bufferAddress   = &sReceivedFrames[i].mPsdu[-1];
            sReceivedFrames[i].mPsdu = NULL;
            nrf_802154_buffer_free_raw(bufferAddress);
        }
    }
}

otRadioState otPlatRadioGetState(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    if (sDisabled)
    {
        return OT_RADIO_STATE_DISABLED;
    }

    return MapRadioDriverStateToOt(sDriverState);
}

bool otPlatRadioIsEnabled(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return !sDisabled;
}

otError otPlatRadioEnable(otInstance *aInstance)
{
    otError error;

#if !OPENTHREAD_CONFIG_MAC_HEADER_IE_SUPPORT
    OT_UNUSED_VARIABLE(aInstance);
#else
    sInstance = aInstance;
#endif

    if (sDisabled)
    {
        sDisabled = false;
        error     = OT_ERROR_NONE;
    }
    else
    {
        error = OT_ERROR_INVALID_STATE;
    }

    return error;
}

otError otPlatRadioDisable(otInstance *aInstance)
{
    otError error = OT_ERROR_NONE;

    otEXPECT(otPlatRadioIsEnabled(aInstance));
    otEXPECT_ACTION(otPlatRadioGetState(aInstance) == OT_RADIO_STATE_SLEEP || isPendingEventSet(kPendingEventSleep),
                    error = OT_ERROR_INVALID_STATE);

    sDisabled = true;

exit:
    return error;
}

otError otPlatRadioSleep(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
    if (nrf54CslSuppressPlatformSleep())
    {
        return OT_ERROR_NONE;
    }
#endif

    if (nrfRadioTryEnterSleep())
    {
        clearPendingEvents();
    }
    else
    {
        clearPendingEvents();
        setPendingEvent(kPendingEventSleep);
    }

    return OT_ERROR_NONE;
}

otError otPlatRadioReceive(otInstance *aInstance, uint8_t aChannel)
{
    OT_UNUSED_VARIABLE(aInstance);

    bool result;

    nrf_802154_channel_set(aChannel);
    if (IsRadioDriverStateSleep())
    {
        // Enable FEM before RADIO leaving SLEEP state.
        nrf5FemEnable();
    }

    nrf_802154_tx_power_set(GetTransmitPowerForChannel(aChannel));
    result = nrf_802154_receive();
    clearPendingEvents();

    if (result)
    {
        SetRadioDriverState(NRF_802154_STATE_RECEIVE);
    }

    return result ? OT_ERROR_NONE : OT_ERROR_INVALID_STATE;
}

static uint64_t unwrapFutureRadioTimeUs(uint32_t aTimeUs)
{
    uint64_t nowUs = otPlatTimeGet();

    /* 32-bit OT radio time → 64-bit GRTC: signed delta unwrap (same rule as alarm_nrf54.c / 52840 radio.c). */
    return nowUs + (int32_t)(aTimeUs - (uint32_t)nowUs);
}

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
otError otPlatRadioReceiveAt(otInstance *aInstance, uint8_t aChannel, uint32_t aStart, uint32_t aDuration)
{
    OT_UNUSED_VARIABLE(aInstance);

    bool     result;
    uint64_t rxTime = unwrapFutureRadioTimeUs(aStart);

    /* A window in the past is not rejected here: parity with NCS radio_nrf5.c, where a late call
     * still lets the driver decide and keeps the CSL anchor at anchor_time + n * csl_period.
     * The first window after CSL is enabled and the one from RestartCslTimerAfterSyncUpdate() are
     * in the past by construction. */
    nrf_802154_tx_power_set(GetTransmitPowerForChannel(aChannel));
    (void)nrf_802154_receive_at_scheduled_cancel(DRX_SLOT_RX);

    result = nrf_802154_receive_at(rxTime, aDuration, aChannel, DRX_SLOT_RX);
    clearPendingEvents();

    return result ? OT_ERROR_NONE : OT_ERROR_FAILED;
}
#endif

#if OPENTHREAD_CONFIG_MAC_HEADER_IE_SUPPORT
static void nrf54ProcessTimeSyncIe(otRadioFrame *aFrame)
{
#if OPENTHREAD_CONFIG_TIME_SYNC_ENABLE
    if (aFrame->mInfo.mTxInfo.mIeInfo->mTimeIeOffset != 0)
    {
        uint8_t *timeIe = aFrame->mPsdu + aFrame->mInfo.mTxInfo.mIeInfo->mTimeIeOffset;
        uint64_t time   = otPlatTimeGet() + aFrame->mInfo.mTxInfo.mIeInfo->mNetworkTimeOffset;

        *timeIe = aFrame->mInfo.mTxInfo.mIeInfo->mTimeSyncSeq;

        *(++timeIe) = (uint8_t)(time & 0xff);
        for (uint8_t i = 1; i < sizeof(uint64_t); i++)
        {
            time        = time >> 8;
            *(++timeIe) = (uint8_t)(time & 0xff);
        }
    }
#endif // OPENTHREAD_CONFIG_TIME_SYNC_ENABLE
}
#endif // OPENTHREAD_CONFIG_MAC_HEADER_IE_SUPPORT

otError otPlatRadioTransmit(otInstance *aInstance, otRadioFrame *aFrame)
{
    nrf_802154_tx_error_t txError = NRF_802154_TX_ERROR_NONE;
    otError               error   = OT_ERROR_NONE;


    aFrame->mPsdu[-1] = aFrame->mLength;

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    nrf_802154_transmitted_frame_props_t frameProps = {
        .is_secured          = aFrame->mInfo.mTxInfo.mIsSecurityProcessed,
        .dynamic_data_is_set = aFrame->mInfo.mTxInfo.mIsHeaderUpdated,
    };
#else
    nrf_802154_transmitted_frame_props_t frameProps = NRF_802154_TRANSMITTED_FRAME_PROPS_DEFAULT_INIT;
#endif

    if (IsRadioDriverStateSleep())
    {
        // Enable FEM before RADIO leaving SLEEP state.
        nrf5FemEnable();
    }

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
#if OPENTHREAD_CONFIG_MAC_HEADER_IE_SUPPORT
    nrf54ProcessTimeSyncIe(aFrame);
#endif

