Antoniazdz/ot-nrf528xx/src/nrf54l15/radio_nrf54.c
    if (aFrame->mInfo.mTxInfo.mTxDelay != 0)
    {
#if NRF_802154_DELAYED_TRX_ENABLED
        nrf_802154_transmit_at_metadata_t atMetadata = {
            .frame_props         = frameProps,
            .cca                 = true,
            .channel             = aFrame->mChannel,
            .tx_power            = {.use_metadata_value = false},
            .extra_cca_attempts  = 0,
            .tx_timestamp_encode = false,
        };
        uint64_t txTime = (uint64_t)aFrame->mInfo.mTxInfo.mTxDelayBaseTime + aFrame->mInfo.mTxInfo.mTxDelay;

        txError = nrf_802154_transmit_raw_at(&aFrame->mPsdu[-1], txTime, &atMetadata);
#else
        error = OT_ERROR_NOT_IMPLEMENTED;
#endif
    }
    else
#endif
    {
        nrf_802154_channel_set(aFrame->mChannel);

#if NRF_802154_CSMA_CA_ENABLED
        if (aFrame->mInfo.mTxInfo.mCsmaCaEnabled)
        {
            nrf_802154_transmit_csma_ca_metadata_t csmaMetadata = {
                .frame_props         = frameProps,
                .tx_power            = {.use_metadata_value = false},
                .tx_channel          = {.use_metadata_value = true, .channel = aFrame->mChannel},
                .tx_timestamp_encode = false,
            };

            (void)nrf_802154_csma_ca_max_backoffs_set(aFrame->mInfo.mTxInfo.mMaxCsmaBackoffs);
            txError = nrf_802154_transmit_csma_ca_raw(&aFrame->mPsdu[-1], &csmaMetadata);
        }
        else
#endif
        {
            /* Match nRF52 radio.c: CCA runs only via the driver CSMA-CA module.
             * transmit_raw() must not honor mCsmaCaEnabled — OT sets it true for
             * data/MLE even when CSMA_CA_ENABLED=0, which caused TxErrCca storms. */
            nrf_802154_transmit_metadata_t metadata = {
                .frame_props         = frameProps,
                .cca                 = false,
                .tx_power            = {.use_metadata_value = false},
                .tx_channel          = {.use_metadata_value = false},
                .tx_timestamp_encode = false,
            };

            txError = nrf_802154_transmit_raw(&aFrame->mPsdu[-1], &metadata);
        }
    }

    if (error == OT_ERROR_NONE && txError == NRF_802154_TX_ERROR_NONE)
    {
        SetRadioDriverState(NRF_802154_STATE_TRANSMIT);
    }

    clearPendingEvents();
    otPlatRadioTxStarted(aInstance, aFrame);

    if (error == OT_ERROR_NONE && txError != NRF_802154_TX_ERROR_NONE)
    {
        setPendingEvent(kPendingEventChannelAccessFailure);
    }

    return error;
}

otRadioFrame *otPlatRadioGetTransmitBuffer(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return &sTransmitFrame;
}

int8_t otPlatRadioGetRssi(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    // Ensure the RSSI measurement is done after RSSI settling time.
    // This is necessary for the Channel Monitor feature which quickly switches between channels.
    NRFX_DELAY_US(RSSI_SETTLE_TIME_US);

    nrf_802154_rssi_measure_begin();

    return nrf_802154_rssi_last_get();
}

otRadioCaps otPlatRadioGetCaps(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return (otRadioCaps)(OT_RADIO_CAPS_ENERGY_SCAN | OT_RADIO_CAPS_ACK_TIMEOUT | OT_RADIO_CAPS_CSMA_BACKOFF |
#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
                         OT_RADIO_CAPS_TRANSMIT_SEC | OT_RADIO_CAPS_TRANSMIT_TIMING | OT_RADIO_CAPS_RECEIVE_TIMING |
#endif
                         OT_RADIO_CAPS_RX_ON_WHEN_IDLE | OT_RADIO_CAPS_SLEEP_TO_TX);
}

void otPlatRadioSetRxOnWhenIdle(otInstance *aInstance, bool aEnable)
{
    OT_UNUSED_VARIABLE(aInstance);

    sRxOnWhenIdle = aEnable;
    nrf_802154_rx_on_when_idle_set(sRxOnWhenIdle);

    if (!sRxOnWhenIdle)
    {
        (void)nrf_802154_sleep_if_idle();
    }
}

bool otPlatRadioGetPromiscuous(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return nrf_802154_promiscuous_get();
}

void otPlatRadioSetPromiscuous(otInstance *aInstance, bool aEnable)
{
    OT_UNUSED_VARIABLE(aInstance);

    nrf_802154_promiscuous_set(aEnable);
}

void otPlatRadioEnableSrcMatch(otInstance *aInstance, bool aEnable)
{
    OT_UNUSED_VARIABLE(aInstance);

    nrf_802154_auto_pending_bit_set(aEnable);
}

otError otPlatRadioAddSrcMatchShortEntry(otInstance *aInstance, uint16_t aShortAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError error;

    if (nrf_802154_pending_bit_for_addr_set(nrf54ShortAddressBytes(&aShortAddress), false))
    {
        error = OT_ERROR_NONE;
    }
    else
    {
        error = OT_ERROR_NO_BUFS;
    }

    return error;
}

otError otPlatRadioAddSrcMatchExtEntry(otInstance *aInstance, const otExtAddress *aExtAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError error;

    if (nrf_802154_pending_bit_for_addr_set(aExtAddress->m8, true))
    {
        error = OT_ERROR_NONE;
    }
    else
    {
        error = OT_ERROR_NO_BUFS;
    }

    return error;
}

otError otPlatRadioClearSrcMatchShortEntry(otInstance *aInstance, uint16_t aShortAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError error;

    if (nrf_802154_pending_bit_for_addr_clear(nrf54ShortAddressBytes(&aShortAddress), false))
    {
        error = OT_ERROR_NONE;
    }
    else
    {
        error = OT_ERROR_NO_ADDRESS;
    }

    return error;
}

otError otPlatRadioClearSrcMatchExtEntry(otInstance *aInstance, const otExtAddress *aExtAddress)
{
    OT_UNUSED_VARIABLE(aInstance);

    otError error;

    if (nrf_802154_pending_bit_for_addr_clear(aExtAddress->m8, true))
    {
        error = OT_ERROR_NONE;
    }
    else
    {
        error = OT_ERROR_NO_ADDRESS;
    }

    return error;
}

void otPlatRadioClearSrcMatchShortEntries(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    nrf_802154_pending_bit_for_addr_reset(false);
}

void otPlatRadioClearSrcMatchExtEntries(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    nrf_802154_pending_bit_for_addr_reset(true);
}

otError otPlatRadioEnergyScan(otInstance *aInstance, uint8_t aScanChannel, uint16_t aScanDuration)
{
    OT_UNUSED_VARIABLE(aInstance);

    sEnergyDetectionTime    = (uint32_t)aScanDuration * 1000UL;
    sEnergyDetectionChannel = aScanChannel;

    clearPendingEvents();

    nrf_802154_channel_set(aScanChannel);

