Antoniazdz/ot-nrf528xx/src/nrf54l15/radio_nrf54.c
void nrf_802154_received_timestamp_raw(uint8_t *p_data, int8_t power, uint8_t lqi, uint64_t time)
{
    otRadioFrame *receivedFrame = NULL;

    SetRadioDriverState(NRF_802154_STATE_RECEIVE);

    for (uint32_t i = 0; i < NRF_802154_RX_BUFFERS; i++)
    {
        if (sReceivedFrames[i].mPsdu == NULL)
        {
            receivedFrame = &sReceivedFrames[i];

            memset(receivedFrame, 0, sizeof(*receivedFrame));
            break;
        }
    }

    assert(receivedFrame != NULL);

    receivedFrame->mPsdu               = &p_data[1];
    receivedFrame->mLength             = p_data[0];
    receivedFrame->mInfo.mRxInfo.mRssi = power;
    receivedFrame->mInfo.mRxInfo.mLqi  = lqi;
    receivedFrame->mChannel            = nrf_802154_channel_get();

    // Inform if this frame was acknowledged with frame pending set.
    if (p_data[ACK_REQUEST_OFFSET] & ACK_REQUEST_BIT)
    {
        receivedFrame->mInfo.mRxInfo.mAckedWithFramePending = sAckedWithFramePending;
    }
    else
    {
        receivedFrame->mInfo.mRxInfo.mAckedWithFramePending = false;
    }

    // Get the timestamp when the SFD was received.
#if !NRF_802154_TX_STARTED_NOTIFY_ENABLED
#error "NRF_802154_TX_STARTED_NOTIFY_ENABLED is required!"
#endif
    receivedFrame->mInfo.mRxInfo.mTimestamp = GetRxTimestamp(time, p_data[0]);

    sAckedWithFramePending = false;

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    // Inform if this frame was acknowledged with secured Enh-ACK.
    if (p_data[ACK_REQUEST_OFFSET] & ACK_REQUEST_BIT && otMacFrameIsVersion2015(receivedFrame))
    {
        receivedFrame->mInfo.mRxInfo.mAckedWithSecEnhAck = sAckedWithSecEnhAck;
        receivedFrame->mInfo.mRxInfo.mAckFrameCounter    = sAckFrameCounter;
        receivedFrame->mInfo.mRxInfo.mAckKeyId           = sAckKeyId;
    }

    sAckedWithSecEnhAck = false;
#endif

    otSysEventSignalPending();
}

void nrf_802154_receive_failed(nrf_802154_rx_error_t error, uint32_t id)
{
#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
    if (id == DRX_SLOT_RX && error == NRF_802154_RX_ERROR_DELAYED_TIMEOUT)
    {

        sAckedWithFramePending = false;
#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
        sAckedWithSecEnhAck = false;
#endif

        if (nrf54CslSuppressPlatformSleep())
        {
            otSysEventSignalPending();
            return;
        }

        /* CSL-P0-F3a: NCS/baseline contract — sleep after CSL window for all children
         * (including rx-off sleepy child). Replaces early return that blocked sleep. */
        setPendingEvent(kPendingEventSleep);
        otSysEventSignalPending();
        return;
    }
#else
    OT_UNUSED_VARIABLE(id);
#endif

    switch (error)
    {
    case NRF_802154_RX_ERROR_INVALID_FRAME:
    case NRF_802154_RX_ERROR_DELAYED_TIMEOUT:
        sReceiveError = OT_ERROR_NO_FRAME_RECEIVED;
        break;

    case NRF_802154_RX_ERROR_INVALID_FCS:
        sReceiveError = OT_ERROR_FCS;
        break;

    case NRF_802154_RX_ERROR_INVALID_DEST_ADDR:
        sReceiveError = OT_ERROR_DESTINATION_ADDRESS_FILTERED;
        break;

    case NRF_802154_RX_ERROR_RUNTIME:
    case NRF_802154_RX_ERROR_TIMESLOT_ENDED:
    case NRF_802154_RX_ERROR_ABORTED:
    case NRF_802154_RX_ERROR_DELAYED_TIMESLOT_DENIED:
    case NRF_802154_RX_ERROR_INVALID_LENGTH:
    case NRF_802154_RX_ERROR_DELAYED_ABORTED:
        sReceiveError = OT_ERROR_FAILED;
        break;

    default:
        assert(false);
    }

    sAckedWithFramePending = false;
#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    sAckedWithSecEnhAck = false;
#endif

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    if ((error == NRF_802154_RX_ERROR_DELAYED_TIMEOUT) || (error == NRF_802154_RX_ERROR_TIMESLOT_ENDED))
    {
        sReceiveError = OT_ERROR_NONE;
#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
        if (!nrf54CslSuppressPlatformSleep())
#endif
        {
            setPendingEvent(kPendingEventSleep);
        }
    }
    else
#endif
    {
        setPendingEvent(kPendingEventReceiveFailed);
    }
}


#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
static void nrf54UpdateTxFrameInfo(const nrf_802154_transmit_done_metadata_t *aMetadata)
{
    sTransmitFrame.mInfo.mTxInfo.mIsSecurityProcessed = aMetadata->frame_props.is_secured;
    sTransmitFrame.mInfo.mTxInfo.mIsHeaderUpdated     = aMetadata->frame_props.dynamic_data_is_set;
}
#endif

void nrf_802154_tx_ack_started(const uint8_t *p_data)
{
    sAckedWithFramePending = p_data[FRAME_PENDING_OFFSET] & FRAME_PENDING_BIT;

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    otRadioFrame ackFrame;

    sAckedWithSecEnhAck = false;

    otEXPECT(p_data[SECURITY_ENABLED_OFFSET] & SECURITY_ENABLED_BIT);

    memset(&ackFrame, 0, sizeof(ackFrame));
    ackFrame.mPsdu   = (uint8_t *)(p_data + 1);
    ackFrame.mLength = p_data[0];

    otEXPECT(otMacFrameIsKeyIdMode1(&ackFrame) && otMacFrameGetKeyId(&ackFrame) != 0);

    sAckedWithSecEnhAck = true;
    sAckFrameCounter    = otMacFrameGetFrameCounter(&ackFrame);
    sAckKeyId           = otMacFrameGetKeyId(&ackFrame);

exit:
    return;
#endif
}

void nrf_802154_transmitted_raw(uint8_t                                   *p_frame,
                                const nrf_802154_transmit_done_metadata_t *p_metadata)
{
    uint8_t *ackPsdu = p_metadata->data.transmitted.p_ack;

    assert(p_frame == sTransmitPsdu);

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    nrf54UpdateTxFrameInfo(p_metadata);
#endif

    SetRadioDriverState(NRF_802154_STATE_RECEIVE);

    if (ackPsdu == NULL)
    {
        sAckFrame.mPsdu = NULL;
    }
    else
    {
        sAckFrame.mInfo.mRxInfo.mTimestamp = GetRxTimestamp(p_metadata->data.transmitted.time, ackPsdu[0]);
        sAckFrame.mPsdu                    = &ackPsdu[1];
        sAckFrame.mLength                  = ackPsdu[0];
        sAckFrame.mInfo.mRxInfo.mRssi      = p_metadata->data.transmitted.power;
        sAckFrame.mInfo.mRxInfo.mLqi       = p_metadata->data.transmitted.lqi;
        sAckFrame.mChannel                 = nrf_802154_channel_get();
    }

    setPendingEvent(kPendingEventFrameTransmitted);
}

void nrf_802154_transmit_failed(uint8_t                                   *p_frame,
                                nrf_802154_tx_error_t                      error,
                                const nrf_802154_transmit_done_metadata_t *p_metadata)
{
    assert(p_frame == sTransmitPsdu);

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    nrf54UpdateTxFrameInfo(p_metadata);
#endif

    SetRadioDriverState(NRF_802154_STATE_RECEIVE);

    switch (error)
    {
    case NRF_802154_TX_ERROR_BUSY_CHANNEL:
        /* fall through */
    case NRF_802154_TX_ERROR_TIMESLOT_ENDED:
    case NRF_802154_TX_ERROR_ABORTED:
    case NRF_802154_TX_ERROR_TIMESLOT_DENIED:
        setPendingEvent(kPendingEventChannelAccessFailure);
        break;

    case NRF_802154_TX_ERROR_INVALID_ACK:
    case NRF_802154_TX_ERROR_NO_ACK:
    case NRF_802154_TX_ERROR_NO_MEM:
        setPendingEvent(kPendingEventInvalidOrNoAck);
        break;

    default:
        assert(false);
    }
}

void nrf_802154_energy_detected(const nrf_802154_energy_detected_t *p_result)
{
    sEnergyDetected = p_result->ed_dbm;
    SetRadioDriverState(NRF_802154_STATE_SLEEP);

    setPendingEvent(kPendingEventEnergyDetected);
}

int8_t otPlatRadioGetReceiveSensitivity(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return NRF54L15_RECEIVE_SENSITIVITY;
}

