Antoniazdz/ot-nrf528xx/src/nrf54l15/radio_nrf54.c
void nrf_802154_random_init(void)
{
    // Intentionally empty
}

void nrf_802154_random_deinit(void)
{
    // Intentionally empty
}

uint32_t nrf_802154_random_get(void)
{
    return otRandomNonCryptoGetUint32();
}

uint64_t otPlatRadioGetNow(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return otPlatTimeGet();
}

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2

static void nrf54SecurityKeyStore(uint8_t *aKeyValue, nrf_802154_key_id_mode_t aKeyIdMode, uint8_t *aKeyId)
{
    nrf_802154_key_t key = {
        .value.p_cleartext_key   = aKeyValue,
        .id.mode                 = aKeyIdMode,
        .id.p_key_id             = aKeyId,
        .type                    = NRF_802154_KEY_CLEARTEXT,
        .frame_counter           = 0,
        .use_global_frame_counter = true,
    };

    nrf_802154_security_error_t err = nrf_802154_security_key_store(&key);

    assert(err == NRF_802154_SECURITY_ERROR_NONE || err == NRF_802154_SECURITY_ERROR_ALREADY_PRESENT);
}

void otPlatRadioSetMacKey(otInstance             *aInstance,
                          uint8_t                 aKeyIdMode,
                          uint8_t                 aKeyId,
                          const otMacKeyMaterial *aPrevKey,
                          const otMacKeyMaterial *aCurrKey,
                          const otMacKeyMaterial *aNextKey,
                          otRadioKeyType          aKeyType)
{
    uint8_t keyIdMode = aKeyIdMode >> 3;
    uint8_t prevKeyId = 0;
    uint8_t nextKeyId = 0;

    OT_UNUSED_VARIABLE(aInstance);

    assert(aKeyType == OT_KEY_TYPE_LITERAL_KEY);
    assert(aPrevKey != NULL && aCurrKey != NULL && aNextKey != NULL);

    NRFX_CRITICAL_SECTION_ENTER();

    if (keyIdMode == 1)
    {
        assert(NRF_802154_SECURITY_KEY_STORAGE_SIZE >= 3);

        /* Thread Key ID Mode 1: valid key indices are 1..0x80 with wrap. */
        prevKeyId = (aKeyId == 1) ? 0x80 : (aKeyId - 1);
        nextKeyId = (aKeyId == 0x80) ? 1 : (aKeyId + 1);

        nrf_802154_security_key_remove_all();

        nrf54SecurityKeyStore((uint8_t *)aPrevKey->mKeyMaterial.mKey.m8, keyIdMode, &prevKeyId);
        nrf54SecurityKeyStore((uint8_t *)aCurrKey->mKeyMaterial.mKey.m8, keyIdMode, &aKeyId);
        nrf54SecurityKeyStore((uint8_t *)aNextKey->mKeyMaterial.mKey.m8, keyIdMode, &nextKeyId);
    }
    else
    {
        /* aKeyId == 0 with mode 0: stack reset / key clear (RCP convention). */
        assert(keyIdMode == 0 && aKeyId == 0);

        nrf_802154_security_key_remove_all();
    }

    NRFX_CRITICAL_SECTION_EXIT();
}

void otPlatRadioSetMacFrameCounter(otInstance *aInstance, uint32_t aMacFrameCounter)
{
    OT_UNUSED_VARIABLE(aInstance);

    NRFX_CRITICAL_SECTION_ENTER();

    sMacFrameCounter = aMacFrameCounter;
    nrf_802154_security_global_frame_counter_set(aMacFrameCounter);

    NRFX_CRITICAL_SECTION_EXIT();
}

void otPlatRadioSetMacFrameCounterIfLarger(otInstance *aInstance, uint32_t aMacFrameCounter)
{
    OT_UNUSED_VARIABLE(aInstance);

    NRFX_CRITICAL_SECTION_ENTER();

    if (aMacFrameCounter > sMacFrameCounter)
    {
        sMacFrameCounter = aMacFrameCounter;
    }

    nrf_802154_security_global_frame_counter_set_if_larger(aMacFrameCounter);

    NRFX_CRITICAL_SECTION_EXIT();
}
#endif // OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE || OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
static void updateIeData(otInstance *aInstance, otShortAddress aShortAddr, const otExtAddress *aExtAddr)
{
    OT_UNUSED_VARIABLE(aInstance);

    int8_t  offset = 0;
    uint8_t ackIeData[OT_ACK_IE_MAX_SIZE];
#if OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
    uint8_t      enhAckProbingDataLen = 0;
    otMacAddress macAddress;
    macAddress.mType                  = OT_MAC_ADDRESS_TYPE_SHORT;
    macAddress.mAddress.mShortAddress = aShortAddr;
#endif

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
    if (sCslPeriod > 0)
    {
        ackIeData[0] = CSL_IE_HEADER_BYTES_LO;
        ackIeData[1] = CSL_IE_HEADER_BYTES_HI;
        offset += OT_IE_HEADER_SIZE + OT_CSL_IE_SIZE; // reserve space for CSL IE
    }
#endif

#if OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE
    if ((enhAckProbingDataLen = otLinkMetricsEnhAckGetDataLen(&macAddress)) > 0)
    {
        offset += otMacFrameGenerateEnhAckProbingIe(ackIeData + offset, NULL, enhAckProbingDataLen);
    }
#endif

    if (offset > 0)
    {
        nrf54AckDataSet(aShortAddr, aExtAddr, ackIeData, (uint16_t)offset);
    }
    else
    {
        nrf54AckDataClear(aShortAddr, aExtAddr);
    }
}
#endif // OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE || OPENTHREAD_CONFIG_MLE_LINK_METRICS_SUBJECT_ENABLE

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
otError otPlatRadioEnableCsl(otInstance         *aInstance,
                             uint32_t            aCslPeriod,
                             otShortAddress      aShortAddr,
                             const otExtAddress *aExtAddr)
{
    sCslPeriod = aCslPeriod;

    /* CSL-F1-BEGIN: hold HFCLK between CSL windows (revert F1: remove block through CSL-F1-END) */
    if (aCslPeriod > 0)
    {
        if (!sCslHfclkHeld)
        {
            nrf_802154_clock_hfclk_start();
            sCslHfclkHeld = true;
        }
    }
    else if (sCslHfclkHeld)
    {
        nrf_802154_clock_hfclk_stop();
        sCslHfclkHeld = false;
    }
    /* CSL-F1-END */
#if NRF_802154_DELAYED_TRX_ENABLED && NRF_802154_IE_WRITER_ENABLED
    nrf_802154_csl_writer_period_set((uint16_t)aCslPeriod);
#endif

    updateIeData(aInstance, aShortAddr, aExtAddr);

    return OT_ERROR_NONE;
}

void otPlatRadioUpdateCslSampleTime(otInstance *aInstance, uint32_t aCslSampleTime)
{
    OT_UNUSED_VARIABLE(aInstance);

    sCslSampleTime = aCslSampleTime;
#if NRF_802154_DELAYED_TRX_ENABLED && NRF_802154_IE_WRITER_ENABLED
    /* The CSL sample time points to the start of the MAC header, while the expected RX time refers
     * to the end of the SFD. */
    uint64_t expectedRxTime = unwrapFutureRadioTimeUs(aCslSampleTime - PHR_DURATION_US);

    nrf_802154_csl_writer_anchor_time_set(nrf_802154_timestamp_phr_to_mhr_convert(expectedRxTime));
#endif
}
#endif // OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE || OPENTHREAD_CONFIG_MAC_CSL_TRANSMITTER_ENABLE
uint8_t otPlatRadioGetCslAccuracy(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return otPlatTimeGetXtalAccuracy() / 2;
}

